<script setup>
import ContentMain from '@/Components/global/ContentMain.vue'
</script>

<template>
  <aside class="mt-16 max-w-6xl mx-auto px-10">
    <content-main
      title="Обучение любой категории"
      text="У нас вы можете обучиться любой категории вождения с опытными инструкторами, готовыми поделиться своими знаниями и навыками. Независимо от того, являетесь ли вы начинающим водителем или хотите усовершенствовать свои навыки."
    />
    <content-main
      title="Доводим обучение до получения прав"
      text="Мы уверены в качестве нашего обучения. Поэтому, если вы не сдали экзамен, мы продолжим обучение без дополнительной платы до тех пор, пока вы не получите водительские права. Наша цель — ваш успех на дороге, и мы готовы идти к ней вместе с вами."
    />
    <content-main
      title="Индивидуальный подход"
      text="Мы придаем особое внимание каждому ученику, предлагая индивидуальный подход к обучению вождению. Мы понимаем, что каждый человек уникален, с разным уровнем опыта и особенностями обучения. Именно поэтому наши опытные инструкторы разрабатывают персонализированные программы, которые отвечают на ваш уровень подготовки и учитывают ваши индивидуальные потребности и цели."
    />
  </aside>
</template>

<style scoped></style>
