<script setup>
import ContentMain from '@/Components/global/ContentMain.vue'
import { reactive } from 'vue'

const listItems = reactive([
  {
    title: 'Обучение любой категории',
    text: 'У нас вы можете обучиться любой категории вождения с опытными инструкторами, готовыми поделиться своими знаниями и навыками. Независимо от того, являетесь ли вы начинающим водителем или хотите усовершенствовать свои навыки.'
  },
  {
    title: 'Доводим обучение до получения прав',
    text: 'Мы уверены в качестве нашего обучения. Поэтому, если вы не сдали экзамен, мы продолжим обучение без дополнительной платы до тех пор, пока вы не получите водительские права. Наша цель — ваш успех на дороге, и мы готовы идти к ней вместе с вами.'
  },
  {
    title: 'Индивидуальный подход',
    text: 'Мы придаем особое внимание каждому ученику, предлагая индивидуальный подход к обучению вождению. Мы понимаем, что каждый человек уникален, с разным уровнем опыта и особенностями обучения. Именно поэтому наши опытные инструкторы разрабатывают персонализированные программы, которые отвечают на ваш уровень подготовки и учитывают ваши индивидуальные потребности и цели.'
  },
  {
    title: 'Подарочный сертификат',
    text: 'Подарите своим близким возможность освоить искусство вождения с нашим подарочным сертификатом на занятия в автошколе! Этот подарок не только поможет им получить водительские навыки, но и обеспечит безопасность и уверенность на дорогах. Сделайте первый шаг к вождению с нами!'
  }
])
</script>

<template>
  <aside id="about" class="mt-16 max-w-6xl mx-auto px-10">
    <section
      class="border-b border-gray-600 mb-10 space-y-10"
      v-for="listItem in listItems"
      :key="listItem"
    >
      <content-main :title="listItem.title" :text="listItem.text" />
    </section>
  </aside>
</template>

<style scoped></style>
